"use client";

import { useState } from "react";
import { ChevronDown } from "lucide-react";

const Items = [
  {
    title: "واچر چیست؟",
    article:
      "بعد از پرداخت هزینه رزرو هتل، یک رسید پرداخت و تاییدیه رزرو هتل از سوی سامانه رزرواسیون برای مسافر صادر می‌شود. این تاییدیه که با نام واچر شناخته می‌شود، در پروفایل کاربری شما قرار خواهد گرفت. لازم به ذکر است که ارائه واچر در هنگام ورود به هتل الزامی است.",
  },

  {
    title: "زمان چک‌این و چک‌اوت هتل چه ساعتی است؟",
    article:
      "چک‌این (تحویل اتاق به مسافر) در اکثر هتل‌های داخلی ساعت ۱۴ و چک‌اوت (تخلیه اتاق توسط مسافر) ساعت ۱۲ ظهر انجام می‌گیرد.",
  },

  {
    title: "آیا امکان تخلیه اتاق دیرتر از ساعت چک‌اوت وجود دارد؟",
    article:
      "برای تخلیه اتاق دیرتر از ساعت چک‌این (حداکثر تا ساعت ۱۸ عصر) می‌بایست هزینه «نیم شارژ خروج» که معمولا نصف هزینه یک شب اقامت است را پرداخت کنید. برای هماهنگی نیم شارژ خروج با پشتیبانی اقامت۲۴ تماس بگیرید.",
  },

  {
    title: "آیا می‌توانم اتاق هتل را زودتر از ساعت چک‌این تحویل بگیرم؟",
    article:
      "شما می‌توانید با پرداخت هزینه‌ای با عنوان «نیم شارژ ورود» که معمولا نصف هزینه یک شب اقامت است، اتاق خود را زودتر از ساعت چک‌این (از حدود ساعت ۸ صبح) تحویل بگیرید. البته این در صورتی است که هتل اتاق خالی برای تحویل به شما داشته باشد. برای هماهنگی نیم شارژ ورود با پشتیبانی اقامت۲۴ تماس بگیرید.",
  },

  {
    title: "آیا امکان کنسلی هتل و استرداد وجه وجود دارد؟",
    article:
      "هتل‌ها برای کنسلی رزرو بسته به مدت زمان باقی‌ مانده تا تاریخ رزرو، درصد جریمه‌ متفاوتی را به عنوان قوانین کنسلی خود تعریف می‌کنند. بعد از ثبت درخواست کنسلی توسط مهمان و پیگیری تیم پشتیبانی، مبلغ پرداختی پس از کسر جریمه به مشتری عودت داده می‌شود. در هنگام رزرو هتل، حتما بخش «قوانین کنسلی» آن را مطالعه نمایید.",
  },

  {
    title: "مزایای رزرو هتل از طریق اقامت24 چیست؟",
    article:
      "برخی از مهم‌ترین مزیت‌های رزرو هتل از اقامت۲۴ عبارتند از: رزرو با بهترین قیمت، تیم حرفه‌ای پشتیبانی۲۴ ساعته، کنسلی بدون کارمزد و…",
  },

  {
    title: "پذیرش رایگان هتل برای کودکان تا چه سنی است؟",
    article:
      "سن مشخص شده برای پذیرش رایگان کودکان برای هتل‌های مختلف کمی متغیر است. بهتر است قبل از رزرو، این مورد را در بخش اطلاعات هتل چک کنید.",
  },

  {
    title: "آیا امکان ویرایش اطلاعات بعد از ثبت نهایی رزرو وجود دارد؟",
    article:
      "در حال حاضر برای ویرایش اطلاعاتی مانند مشخصات مهمانان می‌بایست با تیم پشتیبانی تماس بگیرید.",
  },

  {
    title:
      "اتاق‌ دبل یا توئین و سوئیت‌ جونیور یا امپریال چه تفاوتی با هم دارند؟",
    article:
      "در هتل به اتاق‌های دارای تخت دونفره، اتاق دبل و اتاق دارای دو تخت تک نفره، اتاق توئین یا سینگل گفته می‌شود. طبقه‌بندی سوئیت جونیور و امپریال نیز برای تمایز اتاق‌ها از نظر متراژ و دیزاین نسبت به اتاق معمولی به کار می‌رود.",
  },

  {
    title: "چرا قیمت هتل در اقامت۲۴ تخفیف بیشتری دارد؟",
    article:
      "رزرو ارزان هتل از اقامت۲۴ با تخفیف‌های ویژه همراه است. در اقامت ۲۴ به واسطه داشتن بیشترین مشتریان وفادار، توانسته‌ایم فروش بالایی را برای هتل‌ها رقم زده و قرارداد همکاری بلندمدت با آنها منعقد کنیم. در نتیجه، طی سال‌ها همکاری فوق‌العاده و مذاکرات اثربخش با هتل‌ها، توانسته‌ایم بیشترین میزان تخفیف رزرو هتل را به مشتریان خود ارائه دهیم.",
  },

  {
    title: "آیا هزینه‌ای که برای رزرو پرداخت می‌کنم، مبلغ نهایی است؟",
    article:
      "بله، هزینه پرداختی شما مبلغ نهایی است و تنها در مواردی خاص مانند پیش‌فروش هتل های نوروز، رزرو با نرخ علی‌الحساب انجام می‌شود. البته این موضوع قبل از رزرو به مهمان اطلاع داده می‌شود.",
  },

  {
    title: "آیا اقامت24 خدمات ترانسفر هتل نیز ارائه می‌دهد؟",
    article:
      "به طور کلی، ترانسفر رفت و برگشت فرودگاه یا راه‌آهن جزو خدمات هتل است که با دریافت هزینه و هماهنگی قبلی یا به‌صورت رایگان ارائه می‌شود. با این حال، در برخی از هتل‌ها طبق توافقات اقامت۲۴ با هتل، خدمات ترانسفر رایگان به مهمانانی که از طریق اقامت۲۴ هتل رزرو کرده‌اند، تعلق می‌گیرد. این هتل‌ها را می‌توانید با برچسب «ترانسفر رایگان» در لیست هتل‌های هر شهر مشاهده کنید.",
  },

  {
    title: "آیا در اقامت۲۴ می‌توانم رزرو هتل خارجی با پرداخت ریالی انجام دهم؟",
    article:
      "بله، برای رزرو هتل خارجی با کارت شتاب و پرداخت می‌توانید از طریق سایت اقامت۲۴ اقدام کنید.",
  },

  {
    title: "کنسلی بدون کارمزد در رزرو هتل از اقامت24 به چه معناست؟",
    article:
      "اگر به هر دلیلی مجبور به کنسل کردن رزرو خود شدید، کارمزد کنسلی از طرف اقامت۲۴، از شما دریافت نخواهد شد. لازم به ذکر است جریمه کنسلی که از طرف هتل دریافت می‌شود، بر عهده اقامت ۲۴ نبوده و تابع قوانین هتل است.",
  },
];

export default function FAQDropdown() {
  const [openIndexes, setOpenIndexes] = useState<number[]>([]);
  const handleToggle = (index: number) => {
    setOpenIndexes((prev) =>
      prev.includes(index)
        ? prev.filter((item) => item !== index)
        : [...prev, index],
    );
  };
  return (
    <section className="w-full" dir="rtl">
      <div className="mx-auto w-full border rounded-lg">
        <div>
          {Items.map((item, index) => {
            const isOpen = openIndexes.includes(index);
            return (
              <div key={index} className="overflow-hidden bg-white px-5">
                {/* Question */}
                <button
                  type="button"
                  onClick={() => handleToggle(index)}
                  className="flex min-h-16 w-full items-center
                   justify-between gap-5 py-4 text-right outline-none"
                >
                  <span
                    className={` text-[14px] font-medium leading-7 cursor-pointer
                       transition-colors md:text-[15px] ${isOpen ? "text-[#222]" : "text-[#333]"} `}
                  >
                    {item.title}
                  </span>
                  <span className=" flex h-7 w-7 shrink-0 items-center
                   justify-center rounded-full border border-[#e5e5e5] ">
                    <ChevronDown
                      size={16}
                      strokeWidth={1.8}
                      className={` text-[#555] transition-transform cursor-pointer
                         duration-300 ${isOpen ? "rotate-180" : "rotate-0"} `}
                    />
                  </span>
                </button>
                {/* Answer */}
                <div
                  className={` grid transition-all duration-300
                     ease-in-out ${isOpen ? "grid-rows-[1fr]" : "grid-rows-[0fr]"} `}
                >
                  <div className="overflow-hidden">
                    <div className="border-b border-[#f0f0f0] pb-5 pt-1">
                      <p className="text-[13px] leading-7 text-[#777] md:text-[14px]">
                        {item.article}
                      </p>
                    </div>
                  </div>
                </div>
              </div>
            );
          })}
        </div>
      </div>
    </section>
  );
}
