import { useRef, useState } from "react";
import "../hotelinformation.css";

export default function HotelInformation() {
  const contentRef = useRef<HTMLDivElement>(null);
  const [isExpanded, setIsExpanded] = useState(false);

  return (
    <main className="text-gray-800 hotel-content">
      <div className="relative">
        <div
          ref={contentRef}
          className="overflow-hidden transition-[height] duration-500"
          style={{
            height: isExpanded
              ? `${contentRef.current?.scrollHeight}px`
              : "400px",
          }}
        >
          <h1>رزرو هتل اولین گام سفر</h1>
          <p>
            <span>رزرو هتل</span> یکی از مهم‌ترین مراحل در برنامه‌ریزی سفر است.
            انتخاب هتل مناسب می‌تواند اقامت شما در مقصد را لذت‌بخش‌تر کند و از
            هزینه‌های اضافی در محل مقصد جلوگیری نماید. هنگام رزرو هتل، عواملی
            مانند قیمت، موقعیت مکانی، امکانات هتل و نظرات مسافران قبلی باید مورد
            بررسی قرار گیرند. هتل آپارتمان ها نیز گزینه‌ای مقرون به صرفه هستند و
            امکانات بیشتری را برای مسافران فراهم می‌کنند. با توجه به این نکات،
            هتلی را که با بودجه و نیازهای شما مناسب است رزرو کنید و سفری
            خاطره‌انگیز را تجربه نمایید.
          </p>
          <p>
            تنوع هتل‌ها در قیمت و ارائه خدمات و امکانات گاهی فرایند تصمیم‌گیری
            برای رزرو را کمی زمانبر می‌کند. در چنین شرایطی مرکز رزرواسیون هتل
            اقامت ۲۴ با ارائه سیستم رزرو هتل آنلاین، این فرایند را تسهیل نموده‌
            است.
          </p>
          {/* title */}
          <h2>رزرو آنلاین هتل و مزایای آن در اقامت ۲۴</h2>
          <p>
            در اقامت ۲۴ می‌توانید با مشاهده قیمت هتل، لیست اتاق‌ها، بررسی خدمات،
            امکانات و نظرات مهمانان قبلی انواع هتل‌ها را مقایسه کنید و با
            فیلترهای موجود، نتایج را به فاکتورهای مدنظر خود محدود کنید. با بررسی
            هر یک از مزایای زیر، مطمئن می‌شوید که اقامت۲۴ بهترین سایت رزرو هتل
            است.
          </p>
          <ul>
            <li>رزرو هتل با تخفیف ویژه و بهترین قیمت</li>
            <li>پشتیبانی ۲۴ ساعته رزرو هتل و سایر خدمات</li>
            <li>پوشش کامل هتل‌های ایران</li>
            <li>امکان رزرو هتل خارجی اینترنتی</li>
            <li>امکان رزرو تور برای هتل دلخواه</li>
            <li>ارائه دقیق ترین اطلاعات هتل</li>
            <li>بیشترین آرشیو نظرات کاربران</li>
            <li>کنسلی بدون کارمزد</li>
          </ul>
          {/* title */}
          <h2>رزرو آنلاین هتل با تخفیف ویژه</h2>
          <p>
            انتخاب یک هتل معمولا انتخابی میان قیمت و کیفیت است. با افزایش کیفیت،
            قیمت هتل نیز افزایش می‌یابد. با استفاده از امکانات متنوع سامانه
            رزرواسیون ملی، می‌توانید با مقایسه‌ی امکانات هتل، نظرات کاربران و
            مشاهده تصاویر اتاق های هتل، و همچنین مقایسه ی قیمت های هتل ها و اتاق
            های مختلف، میان قیمت و کیفیت تعادل برقرار کرده و به تناسب نیازهای
            خود، بهترین هتل را انتخاب کنید.
          </p>
          <p>
            در اقامت۲۴ به واسطه داشتن بیشترین مشتریان وفادار توانسته‌ایم فروش
            بالایی را برای هتل‌ها رقم زده و قرارداد همکاری بلندمدت با آنها منعقد
            کنیم. از سال ۸۵ تاکنون به سبب همکاری فوق‌العاده و مذاکرات اثربخش با
            هتل‌ها، توانسته‌ایم رزرو هتل با تخفیف ویژه را به مشتریان خود ارائه
            دهیم.
          </p>
          {/* title */}
          <h2>پشتیبانی ۲۴ ساعته رزرو هتل</h2>
          <p>
            یکی از مزایای رزرو اینترنتی هتل و هتل آپارتمان در اقامت۲۴ پشتیبانی
            ۲۴ ساعته رزرو هتل است. می‌توانید اطمینان داشته باشید که در هر مرحله
            پیش از خرید و بعد از رزرو هتل، تیم پشتیبانی ما آماده پاسخگویی به
            تمام سوالات و چالش‌های شما خواهد بود. از جزیی‌ترین اطلاعات مربوط به
            اتاق‌های هتل، امکانات و خدمات آن تا اطلاع در مورد موقعیت مکانی هتل،
            همگی جزو مواردی است که می‌توانید از تیم پشتیبانی ما درباره آن
            راهنمایی بگیرید و با خیال آسوده هتل خود را رزرو نمایید.
          </p>
          <p>
            چنانچه پس از رزرو به هر دلیلی، تصمیم به کنسلی هتل خود داشتید،
            می‌توانید با اعلام درخواست کنسلی، فرایند لازم برای بازگشت وجه را طی
            نمایید. لازم به ذکر است که قوانین کنسلی بسته به مدت زمان باقیمانده
            تا تاریخ اقامت در هتل و قوانین هر هتل متفاوت است.
          </p>
          {/* title */}
          <h2>پوشش کامل هتل‌های ایران</h2>
          <p>
            پوشش حداکثری هتل‌های ایران، اقامت۲۴ را به بهترین سایت رزرو هتل تبدیل
            نموده است. با ورود به سایت اقامت ۲۴ در بیش از ۱۷۰ شهر مختلف ایران
            می‌توانید اقدام به رزرو هتل داخلی کنید. در حال حاضر تعداد هتل‌های
            داخلی قابل رزرو در سایت اقامت ۲۴ بیش از ۱۵۰۰ هتل است. بنابراین، برای
            انتخاب مناسب ترین هتل گزینه‌های زیادی پیش روی شما خواهد بود. شهرهای
            مشهد، کیش، شیراز، تهران، اصفهان، یزد، شهرهای شمال و تبریز در صدر
            مقاصد پرطرفدار سفر و رزرو هتل داخلی به صورت آنلاین قرار دارند.
            البته، مهم نیست مقصد شما شهری بسیار بزرگ باشد (مانند مرکز استان ها)
            یا شهرهای کوچک‌تر؛ اقامت 24 همیشه برای رزرو بهترین هتل های ایران
            گزینه‌های جذابی پیش روی شما قرار می‌دهد.
          </p>
          {/* title */}
          <h2>امکان رزرو هتل خارجی به‌صورت آنلاین</h2>
          <p>
            یکی از جدیدترین خدماتی که اقامت۲۴ برای مشتریان خود فراهم نموده‌است،
            امکان رزرو هتل خارجی به صورت آنلاین در مقاصد پرسفر ایرانیان مانند
            ترکیه، دبی، ارمنستان، گرجستان و… است. از این پس می‌توانید برای رزرو
            هتل در خارج از کشور نیز، محل اقامت خود را با خیال راحت و با پرداخت
            ریالی از اقامت۲۴ هتل آنلاین رزرو کنید. اقامت ۲۴ بهترین سایت رزرو هتل
            خارجی است که از طریق آن می‌توانید نظرات سایر هموطنانی که در این
            هتل‌‌ها اقامت داشته‌اند را بررسی کنید تا از متناسب بودن سطح خدمات و
            قیمت هتل موردنظر اطمینان پیدا کنید.
          </p>
          {/* title */}
          <h2>امکان رزرو تور برای هتل دلخواه</h2>
          <p>
            یک گام دیگر که برای آسودگی بیشتر شما در هنگام برنامه‌ریزی سفر
            برداشته‌ایم، فراهم کردن امکان رزرو هتل داخلی و خارجی و پرواز به صورت
            تور از اقامت ۲۴ است. رزرو تور از اقامت۲۴ به این شکل است که می‌توانید
            در تاریخ دلخواه برای مدت زمان موردنظر خود، هر یک از هتل‌های موجود در
            اقامت۲۴ را همراه با بلیط رفت و برگشت هواپیما به این مقصد رزرو
            نمایید. در حال حاضر رزرو بلیط هتل به صورت همزمان از اقامت ۲۴ برای
            پرطرفدارترین شهرهای داخلی و برخی از مقاصد رزرو هتل خارج از کشور قابل
            رزرو است.
          </p>
          {/* title */}
          <h2>ارائه دقیق ترین اطلاعات هتل</h2>
          <p>
            تصمیم‌‌‌گیری برای انتخاب و رزرو یک هتل نیاز به بررسی دقیق خدمات،
            امکانات هتل، محل قرارگیری هتل و تصاویر آن در سامانه رزرو هتل دارد.
            در اقامت ۲۴ دقیق‌ترین جزییات در مورد هتل‌ها حتی مواردی مانند فاصله
            هتل تا مهم‌ترین جاذبه‌های شهر را در اختیار شما قرار داده‌ایم تا
            انتخابی هوشمندانه داشته باشید. بررسی تصاویر هتل شامل دکوراسیون
            اتاق‌ها و فضاهایی مانند رستوران یا لابی به شما کمک می‌کند تا نسبت به
            محل اقامت خود یک دید کلی پیدا کنید.
          </p>
          {/* title */}
          <h2>نظرات مسافران و مردم درباره‌ی هتل‌های مختلف در بزرگترین آرشیو</h2>
          <p>
            مهم‌ترین بخشی که در هنگام رزرو هتل داخلی و خارجی نظر شما را جلب
            می‌کند، مشاهده نظرات مهمانان قبلی هر هتل است. به این ترتیب می‌توانید
            از تجربه سایر افراد برای تصمیم گیری راهنمایی بگیرید. در اقامت۲۴ طیف
            وسیع مشتریان، گنجینه‌ای از نظرات ارزشمند کاربران را به همراه
            داشته‌است. برای انتخاب مناسب ترین هتل حتما سری به بخش نظرات مهمانان
            بزنید و به امتیازهایی که هتل از سوی کاربران دریافت نموده‌است، دقت
            کنید.
          </p>
          {/* title */}
          <h2>فرایند رزرو هتل از اقامت ۲۴</h2>
          <p>
            فرایند رزرو و اجاره هتل در اقامت۲۴ بسیار ساده است. کافیست وارد صفحه
            اصلی سایت هتل شوید، شهر مقصد، تاریخ سفر و مدت زمان اقامت خود را
            انتخاب نمایید و دکمه جستجو را بزنید. در ادامه به صفحه هتل‌های این
            شهر هدایت می‌شوید. می‌توانید از لیست هتل‌های هر شهر تنوع اتاق‌ها و
            قیمت رزرو آن را مشاهده کنید. علاوه‌بر این، امکان محدود کردن نتایج بر
            اساس برخی فیلترها مانند محدوده قیمتی مدنظر شما برای رزرو هتل ارزان
            یا لوکس، نوع مکان اقامتی، تعداد ستاره و… وجود دارد.
          </p>
          <p>
            با استفاده از فیلترهای متنوع سایت اقامت ۲۴ می‌توان هتل‌های ارزان هر
            شهر را به راحتی پیدا کرده و به بررسی امکانات آنها پرداخت. امروزه با
            رقابتی شدن صنعت هتل‌داری، هتل‌های ارزان نیز از کیفیت قابل قبول و در
            برخی موارد بسیار خوبی برخوردار هستند. با رزرو هتل‌های ارزان می‌توان
            در کنار یافتن مکانی برای اقامت، از هزینه‌ی صرفه‌جویی شده برای لذت
            بخش‌تر کردن سفر مانند دیدن جاهای دیدنی بیشتر یا خرید سوغاتی‌های
            متنوع استفاده کرد. اگر هزینه دغدغه‌ی بزرگی در تصمیم‌گیری شما نیست،
            می‌توانید با انتخاب و رزرو آنلاین هتل های ۵ ستاره، تجربه‌ای فراموش
            نشدنی از سفر و اقامت خود داشته باشید.
          </p>
          <p>
            در نهایت، با انتخاب هر هتل به صفحه رزرو آن منتقل می‌شوید؛ در اینجا
            تمام جزئیات اعم از تصاویر، خدمات و امکانات و تنوع اتاق‌های هتل قابل
            مشاهده است. کافیست پس از بررسی نهایی، دکمه رزرو اتاق را بزنید. بعد
            از رفتن به صفحه رزرو و درج اطلاعات مسافران، به صفحه پرداخت ارجاع
            داده می‌شوید و رزرو شما ثبت خواهد شد. چنانچه ظرفیت رزرو هتل انتخابی
            شما تکمیل شده باشد، همکاران تیم پشتیبانی اقامت 24 با شما تماس گرفته
            و سایر هتل‌های مناسب با درخواست شما را پیشنهاد می‌دهند.
          </p>
          {/* title */}
          <h2>نحوه پیگیره رزرو هتل آنلاین</h2>
          <p>
            اگر بعد از نهایی شدن رزرو، قصد داشتید اطلاعات رزرو خود مانند تاریخ
            ورود به هتل، صحت اطلاعات مهمانان و... را مجددا بررسی کنید، می‌توانید
            بدون وارد شدن به حساب کاربری، تنها با وارد کردن کد پیگیری رزرو خود
            در بخش «پیگیری رزرو» موجود در نوار بالایی صفحه اصلی سایت، این کار را
            انجام دهید.
          </p>
          {/* title */}
          <h2>دسته‌بندی هتل‌ها بر اساس ستاره</h2>
          <p>
            در زمان رزرو هتل، آشنایی با طبقه‌بندی هتل‌ها و سطح خدمات هر کدام نقش
            مهمی در انتخاب اقامتگاه مناسب دارد. هتل‌ها بر اساس سطح کیفیت
            امکانات، خدمات و طراحی از یک تا پنج‌ستاره رتبه‌بندی می‌شوند. این
            درجه‌بندی در هر کشور ممکن است با استانداردهای خاصی انجام شود.
            هتل‌های پنج‌ستاره در بالاترین سطح قرار دارند و با طراحی لوکس،
            امکاناتی چون استخر، اسپا، چند رستوران بین‌المللی، ترانسفر اختصاصی و
            خدمات شخصی‌سازی‌شده، تجربه‌ای ممتاز را ارائه می‌دهند. هتل‌های
            چهار‌ستاره نیز با کیفیت بالا و امکاناتی نظیر باشگاه، رستوران یا
            استخر و اسپا انتخابی مناسب برای اقامت راحت هستند. در سطح بعد،
            هتل‌های سه‌ستاره تعادل مطلوبی میان قیمت و خدمات ایجاد می‌کنند و با
            امکاناتی مانند وای‌فای، رستوران و نظافت روزانه، گزینه‌ای محبوب برای
            خانواده‌ها در سفر‌های اقتصادی هستند. هتل‌های دو‌ستاره و یک‌ستاره نیز
            برای سفرهای کم‌هزینه طراحی شده‌اند و امکانات پایه‌ای چون اتاق تمیز،
            تلویزیون، تهویه و پذیرش ۲۴ ساعته را ارائه می‌دهند. در مجموع، هر چه
            تعداد ستاره‌های هتل بالاتر باشد، تنوع خدمات، کیفیت تجهیزات و سطح
            رفاه مهمانان نیز افزایش می‌یابد.
          </p>
          {/* title */}
          <h2>انواع هتل بر اساس نوع و سبک اقامت</h2>
          <p>
            هتل‌ها فقط بر اساس تعداد ستاره‌ها دسته‌بندی نمی‌شوند؛ بلکه عواملی
            مانند موقعیت مکانی و نوع تجربه‌ای که به مسافران ارائه می‌دهند نیز در
            تقسیم بندی نقش دارد. هر نوع هتل با سبک اقامتی مشخص و فضایی متفاوت
            طراحی شده تا پاسخگوی نیازها و هدف‌های مختلف سفر باشد. در ادامه
            می‌توانید با انواع هتل‌ها بر اساس سبک اقامت آشنا شوید و متناسب با
            برنامه سفر خود، بهترین گزینه را انتخاب کنید:
          </p>
          {/* title */}
          <h2>متل‌ها</h2>
          <p>
            متل‌ها در واقع هتل‌های بین‌راهی هستند که در مسیرهای بین‌شهری یا
            نزدیک ورودی شهرها واقع شده‌اند. این اقامتگاه‌ها ساختمان‌های ساده یک
            یا دو طبقه دارند و برای مسافرانی که با خودرو شخصی سفر می‌کنند،
            گزینه‌ای ایده‌آل برای استراحت کوتاه مدت و رفع خستگی در مسیر محسوب
            می‌شوند. همچنین به دلیل قیمت کم، گزینه‌ای مناسب برای اقامت اقتصادی
            هستند.
          </p>
          {/* title */}
          <h2>بوتیک هتل</h2>
          <p>
            بوتیک‌هتل‌ها فضایی کوچک‌تر و صمیمی‌تر نسبت به هتل‌های معمولی دارند و
            با طراحی منحصر‌به‌فرد و توجه به جزئیات اتاق‌ها، تجربه‌ای متفاوت از
            اقامت را به مهمانان ارائه می‌کنند. هر اتاق طراحی ویژه و خاص خود را
            دارد که شامل وسایل و تزئینات اختصاصی است. موقعیت مکانی این هتل‌ها
            معمولا نزدیک به جاذبه‌های دیدنی و مناطق پرطرفدار شهر است.
          </p>
          {/* title */}
          <h2>هتل آپارتمان‌ها</h2>
          <p>
            هتل‌آپارتمان‌ها با واحدهای مبله، فضای نشیمن و امکانات کامل آشپزی،
            گزینه‌ای مناسب برای اقامت‌های بلندمدت خانواده‌ها هستند. این هتل‌ها
            علاوه‌بر آزادی عمل و راحتی بیشتر، از نظر اقتصادی هم به صرفه بوده و
            تجربه‌ای شبیه اقامت در خانه را برای شما به ارمغان می‌آورند.
          </p>
          {/* title */}
          <h2>هتل‌های ریزورت</h2>
          <p>
            ریزورت‌ها مجموعه‌های اقامتی لوکسی هستند که در مجاورت ساحل، طبیعت بکر
            یا مناطق کوهستانی ساخته می‌شوند و با طیف کاملی از امکانات تفریحی و
            رفاهی ممتاز، تجربه‌ای فراتر از یک اقامت معمولی را رقم می‌زنند. در
            این هتل‌ها، مهمانان بدون نیاز به خروج از مجموعه می‌توانند از
            امکاناتی مانند استخرهای متنوع، اسپا و خدمات سلامتی، ساحل اختصاصی،
            پارک آبی و رستوران‌های متعدد با منوهای متنوع بهره‌مند شوند. همچنین
            ارائه خدمات All Inclusive یا Ultra All Inclusive باعث می‌شود تمامی
            نیازهای اقامتی و تفریحی در قالب یک پکیج کامل فراهم شده و مهمانان،
            اقامتی لوکس، آسوده و متفاوت را تجربه کنند.
          </p>
          {/* title */}
          <h2>هتل‌های فرودگاهی</h2>
          <p>
            این هتل‌ها اقامتگاه‌هایی هستند که در فاصله‌ای کوتاه از فرودگاه‌ها
            قرار دارند و گزینه‌ای عالی برای استراحت مسافران در فاصله بین پروازها
            محسوب می‌شوند. هتل‌های فرودگاهی با فراهم کردن امکانات رفاهی کامل،
            شرایط یک اقامت راحت و بدون دغدغه را مهیا می‌کنند و این امکان را در
            اختیار مسافران قرار می‌دهند تا در صورت نیاز، اتاق‌ها را به‌صورت
            ساعتی نیز رزرو کنند.
          </p>
          {/* title */}
          <h2>هاستل</h2>
          <p>
            هاستل نوعی اقامتگاه اقتصادی است که برای سفر‌های انفرادی و کم‌هزینه
            بهترین گزینه محسوب می‌شود و بین جوانان و دانشجویان محبوبیت بیشتری
            دارد. در هاستل بجای اتاق‌های خصوصی، اتاق‌ها اشتراکی با فضاهای عمومی،
            آشپزخانه و حمام دستشویی مشترک وجود دارد. همچنین حضور در هاستل فرصت
            مناسبی برای آشنایی با مسافران از سراسر دنیا را فراهم می‌کند.
          </p>
          {/* title */}
          <h2>انواع اتاق‌ در هتل‌ها</h2>
          <p>
            اتاق‌های هتل‌ها بر اساس سطح امکانات، ظرفیت و نوع طراحی به چند گروه
            اصلی تقسیم می‌شوند. آشنایی با این دسته‌بندی‌ها به شما کمک می‌کند
            هنگام رزرو هتل، گزینه‌ای متناسب با نیاز و بودجه خود انتخاب کنید.
          </p>
          {/* title */}
          <h2>انواع اتاق بر اساس سطح امکانات</h2>
          <p>
            اتاق‌های هتل‌ها بر اساس سطح امکانات و ظرفیت به چند گروه اصلی تقسیم
            می‌شوند:
          </p>
          <ul>
            <li>
              اتاق استاندارد (Standard Room): رایج‌ترین اتاق در بیشتر هتل‌ها است
              که شامل امکانات پایه می‌شود.
            </li>
            <li>
              اتاق دلوکس (Deluxe Room): اتاق‌هایی با متراژ و امکاناتی بیشتر از
              اتاق‌های استاندارد که معمولا چشم‌انداز بهتری دارند.
            </li>
          </ul>
          <p>
            در برخی از هتل‌های چهار و پنج‌ستاره، اتاق‌های ویژه‌ای با عنوان
            پرزیدنتال و رویال نیز ارائه می‌شود که جزو لوکس‌ترین و مجهزترین
            واحدهای اقامتی هستند.
          </p>
          {/* title */}
          <h2>انواع اتاق بر اساس نوع تخت و ظرفیت</h2>
          <p>
            اتاق‌های هتل‌ها از نظر تعداد تخت‌ و ظرفیت پذیرش، تفاوت‌های زیادی
            دارند که در ادامه به معرفی آن‌ها پرداخته‌ایم:
          </p>
          <ul>
            <li>
              اتاق سینگل (Single Room): اتاق‌هایی با تخت تک نفره که برای اقامت
              یک نفر طراحی شده‌اند.
            </li>
            <li>
              اتاق دبل (Double Room): شامل یک تخت دونفره (Queen یا King Size)
              بوده و برای زوج‌ها یا اقامت دونفره مناسب است.
            </li>
            <li>
              اتاق توئین (Twin Room): شامل اتاق‌هایی با ۲ تخت تک نفره برای اقامت
              دوستان و همکاران می‌شود.
            </li>
            <li>
              اتاق تریپل (Triple Room): اتاقی مناسب برای سه نفر است و شامل سه
              تخت تک‌نفره یا یک تخت دونفره به‌همراه یک تخت تک‌نفره است.
            </li>
            <li>
              اتاق فمیلی (Family Room): با ظرفیت بالاتر و فضای بزرگ‌تر طراحی شده
              و معمولا شامل چند تخت و امکانات مناسب خانواده‌ها است.
            </li>
          </ul>
          {/* table */}
          <table className="hotel-table">
            <thead>
              <tr>
                <th>نوع اتاق</th>
                <th>ظرفیت</th>
                <th>نوع تخت</th>
              </tr>
            </thead>

            <tbody>
              <tr>
                <td>سینگل</td>
                <td>۱ نفر</td>
                <td>۱ تخت سینگل</td>
              </tr>

              <tr>
                <td>دبل</td>
                <td>۲ نفر</td>
                <td>۱ تخت دبل</td>
              </tr>

              <tr>
                <td>توئین</td>
                <td>۲ نفر</td>
                <td>۲ تخت سینگل</td>
              </tr>

              <tr>
                <td>تریپل</td>
                <td>۳ نفر</td>
                <td>۳ تخت سینگل یا ۱ دبل و ۱ سینگل</td>
              </tr>

              <tr>
                <td>فمیلی</td>
                <td>۳ تا ۵ نفر</td>
                <td>بسته به تعداد نفرات نوع تخت متغیر</td>
              </tr>
            </tbody>
          </table>
          {/* title */}
          <h2>انواع واحدهای اقامتی در هتل‌ها</h2>
          <p>
            واحدهای اقامتی در هتل‌ها بسته به سطح امکانات، متراژ و نوع خدمات به
            چند گروه تقسیم می‌شوند و هرکدام برای نوع خاصی از سفر طراحی شده‌اند.
          </p>
          {/* title */}
          <h2>سوئیت (Suite)</h2>
          <p>
            سوئیت‌ها از محبوب‌ترین و لوکس‌ترین واحدهای اقامتی در هتل‌ها هستند.
            این واحدها معمولا شامل یک یا چند اتاق‌خواب، سالن نشیمن مجزا و گاهی
            آشپزخانه می‌شوند.
          </p>
          {/* title */}
          <h2></h2>
          <p></p>
          {/* title */}
          <h2>ویلا (Villa)</h2>
          <p>
            ویلاها واحدهای مستقل در محوطه هتل هستند که چند اتاق‌خواب، نشیمن،
            آشپزخانه و گاهی استخر خصوصی یا باغ اختصاصی دارند. معمولا هتل‌های
            ساحلی یا ریزورت ویلا دارند.
          </p>
          {/* title */}
          <h2>کابانا (Cabana)</h2>
          <p>
            کاباناها اتاق‌ها یا سوئیت‌های کوچکی هستند که در محوطه هتل و بدور از
            شلوغی ساختمان اصلی قرار گرفته‌اند.
          </p>
          {/* title */}
          <h2>اتاق کانکت (Connected Room)</h2>
          <p>
            اتاق‌های کانکت از دو اتاق مجزا که از طریق درب‌های داخلی به هم متصل
            می‌شوند و برای خانواده‌ها و گروه‌های دوستانه مناسب هستند تشکیل شده
            اند.
          </p>
          {/* title */}
          <h2>آپارتمان</h2>
          <p>
            شامل واحدهایی با نشیمن و اتاق‌خواب مجزا است که با داشتن آشپزخانه و
            تجهیزات پخت‌وپز، فضایی شبیه به خانه را برای اقامت فراهم می‌کند.
          </p>
          {/* title */}
          <h2>اصطلاحات عمومی هتل</h2>
          <p>
            برای استفاده بهتر از امکانات و خدمات هتل در طول اقامت، آشنایی با
            برخی اصطلاحات هتلی می‌تواند باعث شود از خدمات بهتر و باکیفیت‌تری
            بهره‌مند شوید. در ادامه، فهرستی از اصطلاحات پرکاربرد هتل را بیان
            کرده‌‌ایم:
          </p>
          {/* title */}
          <h2>اصطلاحات مربوط به رزرو و خدمات هتل</h2>
          <p>
            اصطلاحات و واژه‌هایی که در زمان رزرو هتل یا پذیرش اتاق لازم است
            بدانید عبارتند از:
          </p>
          <ul>
            <li>
              Check-in (چک‌این): زمان ورود مهمانان به هتل و دریافت اتاق که
              معمولا بین ساعت ۱۴ تا ۱۵ انجام می‌شود.
            </li>
            <li>
              Check-out (چک‌اوت): زمان خروج از هتل، که معمولا تا ساعت ۱۲ ظهر
              است.
            </li>
            <li>
              نیم شارژ ورود یا خروج : ورود زود هنگام (زودتر از ساعت چک‌این) یا
              خروج دیر هنگام (دیرتر از ساعت چک‌اوت)که با پرداخت هزینه مجزا همراه
              است.
            </li>
            <li>
              Voucher (واچر): تاییدیه رزرو هتل که اطلاعات رزرو و نام مهمان در آن
              ثبت شده است.
            </li>
            <li>
              Mini Bar: یخچال کوچک داخل اتاق که شامل نوشیدنی و خوراکی است.
            </li>
            <li>
              Laundry: خدمات شست‌وشوی و خشکشویی لباس که در بیشتر هتل‌ها ارائه
              می‌شود.
            </li>
            <li>
              Room Service (روم‌سرویس): مهمانان می‌توانند غذا، نوشیدنی یا
              میان‌وعده را مستقیما به داخل اتاق خود سفارش دهند و بدون نیاز به
              خروج از اتاق، از خدمات پذیرایی هتل بهره‌مند شوند.
            </li>
          </ul>
          {/* title */}
          <h2>اصطلاحات مربوط به وعده‌های غذایی</h2>
          <p>
            در زمان رزرو اتاق، نوع خدمات غذایی یکی از نکات مهمی است که باید به
            آن توجه کنید. هر هتل با توجه به امکانات خود، سطح متفاوتی از پذیرایی
            را ارائه می‌دهد که آشنایی با این خدمات بسیار مهم است:
          </p>
          <ul>
            <li>Bed & Breakfast : به معنای اقامت همراه با صبحانه (bb) است.</li>
            <li>Only room: شامل اتاق‌هایی بدون وعده غذایی می‌شود.</li>
            <li>
              ‌half board: اقامت هافبرد (‌hf) یعنی صبحانه به همراه یک وعده غذایی
              (ناهار یا شام) که در زمان رزرو مشخص می‌شود.
            </li>
            <li>
              Full board: اقامت فولبرد (fb) یعنی اقامت با تمام وعده‌های غذایی
              (صبحانه، ناهار و شام) که در رستوران هتل سرو می‌شود.
            </li>
            <li>
              All Inclusive: خدمات آل ( all) شامل تمام وعده‌های غذایی، میان وعده
              و نوشیدنی‌های رایگان در طول روز است که در برخی هتل‌ها تفریحاتی
              مانند استخر، پارک‌آبی و سایر خدمات را نیز شامل می‌شود.
            </li>
            <li>
              Ultra All Inclusive: خدمات یوآل (‌uall) کامل‌ترین خدمات هتلی است
              که شامل وعده‌های غذایی و نوشیدنی نامحدود ۲۴ ساعته است. در این نوع
              خدمات، مهمانان می‌توانند از تمام امکانات هتل مانند اسپا، استخر،
              ورزش‌ها و رستوران‌ها بدون محدودیت و نیاز به رزرو قبلی بهره‌مند
              شوند و تجربه‌ای کامل و لوکس از اقامت داشته باشند.
            </li>
          </ul>
        </div>
        {!isExpanded && (
          <div
            className="
          pointer-events-none
      absolute
      bottom-0
      left-0
      right-0
      h-20
      bg-gradient-to-t
      from-white
      via-white/80
      to-transparent
      z-10"
          />
        )}
      </div>

      <div className="w-full text-center text-[12px] lg:text-[14px]">
        <button
          onClick={() => setIsExpanded((prev) => !prev)}
          className="mt-4 text-[#37a0fb]"
        >
          {isExpanded ? "نمایش کمتر" : "نمایش بیشتر"}
        </button>
      </div>
    </main>
  );
}
